TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                              PC v20.2.7.LTS *
       3                    ;* Date/Time created: Fri Aug 29 14:42:20 2025                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --embed
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../main.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen PC v20.2.7.LTS Copyright (c) 1996
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Jon\Uni stuff\CE\Embedded-Systems\SC2107\CE2007\Lab1_C_Pr
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("Clock_Delay1ms")

     861 00000152 2005              MOVS      A1, #5                ; [DPU_V7M3_PIPE] |152|  ; [ORIG 16-BIT INS]
     862                    $C$DW$45        .dwtag  DW_TAG_TI_branch
     863                            .dwattr $C$DW$45, DW_AT_low_pc(0x00)
     864                            .dwattr $C$DW$45, DW_AT_name("Port2_Output")
     865                            .dwattr $C$DW$45, DW_AT_TI_call
     866                    
     867 00000154 FFFEF7FF!         BL        Port2_Output          ; [DPU_V7M3_PIPE] |152|  ; [KEEP 32-BIT INS]
     868                            ; CALL OCCURS {Port2_Output }    ; [] |152| 
     869                            .dwpsn  file "../main.c",line 157,column 9,is_stmt,isa 1
     870 00000158 2001              MOVS      A1, #1                ; [DPU_V7M3_PIPE] |157|  ; [ORIG 16-BIT INS]
     871                    $C$DW$46        .dwtag  DW_TAG_TI_branch
     872                            .dwattr $C$DW$46, DW_AT_low_pc(0x00)
     873                            .dwattr $C$DW$46, DW_AT_name("Port1_Output")
     874                            .dwattr $C$DW$46, DW_AT_TI_call
     875                    
     876 0000015a FFFEF7FF!         BL        Port1_Output          ; [DPU_V7M3_PIPE] |157|  ; [KEEP 32-BIT INS]
     877                            ; CALL OCCURS {Port1_Output }    ; [] |157| 
     878                            .dwpsn  file "../main.c",line 158,column 9,is_stmt,isa 1
     879 0000015e E7EE              B         ||$C$L9||             ; [DPU_V7M3_PIPE] |158|  ; [ORIG 16-BIT INS]
     880                            ; BRANCH OCCURS {||$C$L9||}      ; [] |158| 
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   17

     881                    ;* --------------------------------------------------------------------------*
     882                            .dwattr $C$DW$33, DW_AT_TI_end_file("../main.c")
     883                            .dwattr $C$DW$33, DW_AT_TI_end_line(0xa5)
     884                            .dwattr $C$DW$33, DW_AT_TI_end_column(0x01)
     885                            .dwendentry
     886                            .dwendtag $C$DW$33
     887                    
     888                    ;******************************************************************************
     889                    ;* CONSTANT TABLE                                                             *
     890                    ;******************************************************************************
     891 00000160                   .sect   ".text"
     892                            .align  4
     893 00000160 40004C0C  ||$C$CON2||:    .bits           0x40004c0c,32
     894                    
     895                            .align  4
     896 00000164 40004C02  ||$C$CON5||:    .bits           0x40004c02,32
     897                    
     898                            .align  4
     899 00000168 40004C03  ||$C$CON10||:   .bits           0x40004c03,32
     900                    
     901                            .align  4
     902 0000016c 00000000! ||$C$CON11||:   .bits   ||$P$T0$1||,32
     903                    ;*****************************************************************************
     904                    ;* UNDEFINED EXTERNAL REFERENCES                                             *
     905                    ;*****************************************************************************
     906                            .global Clock_Delay1ms
     907                    
     908                    ;******************************************************************************
     909                    ;* BUILD ATTRIBUTES                                                           *
     910                    ;******************************************************************************
     911                            .battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
     912                            .battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ0111111111100000000000000
     913                            .battr "aeabi", Tag_File, 1, Tag_ABI_PCS_wchar_t(2)
     914                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_rounding(0)
     915                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_denormal(0)
     916                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_exceptions(0)
     917                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_number_model(1)
     918                            .battr "aeabi", Tag_File, 1, Tag_ABI_enum_size(1)
     919                            .battr "aeabi", Tag_File, 1, Tag_ABI_optimization_goals(3)
     920                            .battr "aeabi", Tag_File, 1, Tag_ABI_FP_optimization_goals(0)
     921                            .battr "TI", Tag_File, 1, Tag_Bitfield_layout(0)
     922                            .battr "aeabi", Tag_File, 1, Tag_ABI_VFP_args(3)
     923                            .battr "TI", Tag_File, 1, Tag_FP_interface(1)
     924                    
     925                    ;******************************************************************************
     926                    ;* TYPE INFORMATION                                                           *
     927                    ;******************************************************************************
     928                    
     929                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     930                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1e)
     931                    $C$DW$47        .dwtag  DW_TAG_member
     932                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$23)
     933                            .dwattr $C$DW$47, DW_AT_name("IN")
     934                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("IN")
     935                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   18

     936                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     937                            .dwattr $C$DW$47, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     938                            .dwattr $C$DW$47, DW_AT_decl_line(0x288)
     939                            .dwattr $C$DW$47, DW_AT_decl_column(0x0f)
     940                    
     941                    $C$DW$48        .dwtag  DW_TAG_member
     942                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     943                            .dwattr $C$DW$48, DW_AT_name("RESERVED0")
     944                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("RESERVED0")
     945                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     946                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     947                            .dwattr $C$DW$48, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     948                            .dwattr $C$DW$48, DW_AT_decl_line(0x289)
     949                            .dwattr $C$DW$48, DW_AT_decl_column(0x0b)
     950                    
     951                    $C$DW$49        .dwtag  DW_TAG_member
     952                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$24)
     953                            .dwattr $C$DW$49, DW_AT_name("OUT")
     954                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("OUT")
     955                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     956                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     957                            .dwattr $C$DW$49, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     958                            .dwattr $C$DW$49, DW_AT_decl_line(0x28a)
     959                            .dwattr $C$DW$49, DW_AT_decl_column(0x10)
     960                    
     961                    $C$DW$50        .dwtag  DW_TAG_member
     962                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
     963                            .dwattr $C$DW$50, DW_AT_name("RESERVED1")
     964                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("RESERVED1")
     965                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     966                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     967                            .dwattr $C$DW$50, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     968                            .dwattr $C$DW$50, DW_AT_decl_line(0x28b)
     969                            .dwattr $C$DW$50, DW_AT_decl_column(0x0b)
     970                    
     971                    $C$DW$51        .dwtag  DW_TAG_member
     972                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$24)
     973                            .dwattr $C$DW$51, DW_AT_name("DIR")
     974                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("DIR")
     975                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     976                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     977                            .dwattr $C$DW$51, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     978                            .dwattr $C$DW$51, DW_AT_decl_line(0x28c)
     979                            .dwattr $C$DW$51, DW_AT_decl_column(0x10)
     980                    
     981                    $C$DW$52        .dwtag  DW_TAG_member
     982                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
     983                            .dwattr $C$DW$52, DW_AT_name("RESERVED2")
     984                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("RESERVED2")
     985                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     986                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     987                            .dwattr $C$DW$52, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     988                            .dwattr $C$DW$52, DW_AT_decl_line(0x28d)
     989                            .dwattr $C$DW$52, DW_AT_decl_column(0x0b)
     990                    
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   19

     991                    $C$DW$53        .dwtag  DW_TAG_member
     992                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
     993                            .dwattr $C$DW$53, DW_AT_name("REN")
     994                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("REN")
     995                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     996                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     997                            .dwattr $C$DW$53, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
     998                            .dwattr $C$DW$53, DW_AT_decl_line(0x28e)
     999                            .dwattr $C$DW$53, DW_AT_decl_column(0x10)
    1000                    
    1001                    $C$DW$54        .dwtag  DW_TAG_member
    1002                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
    1003                            .dwattr $C$DW$54, DW_AT_name("RESERVED3")
    1004                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("RESERVED3")
    1005                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1006                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwattr $C$DW$54, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1008                            .dwattr $C$DW$54, DW_AT_decl_line(0x28f)
    1009                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
    1010                    
    1011                    $C$DW$55        .dwtag  DW_TAG_member
    1012                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$24)
    1013                            .dwattr $C$DW$55, DW_AT_name("DS")
    1014                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("DS")
    1015                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1016                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1017                            .dwattr $C$DW$55, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1018                            .dwattr $C$DW$55, DW_AT_decl_line(0x290)
    1019                            .dwattr $C$DW$55, DW_AT_decl_column(0x10)
    1020                    
    1021                    $C$DW$56        .dwtag  DW_TAG_member
    1022                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
    1023                            .dwattr $C$DW$56, DW_AT_name("RESERVED4")
    1024                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("RESERVED4")
    1025                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1026                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1027                            .dwattr $C$DW$56, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1028                            .dwattr $C$DW$56, DW_AT_decl_line(0x291)
    1029                            .dwattr $C$DW$56, DW_AT_decl_column(0x0b)
    1030                    
    1031                    $C$DW$57        .dwtag  DW_TAG_member
    1032                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$24)
    1033                            .dwattr $C$DW$57, DW_AT_name("SEL0")
    1034                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("SEL0")
    1035                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1036                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1037                            .dwattr $C$DW$57, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1038                            .dwattr $C$DW$57, DW_AT_decl_line(0x292)
    1039                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
    1040                    
    1041                    $C$DW$58        .dwtag  DW_TAG_member
    1042                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
    1043                            .dwattr $C$DW$58, DW_AT_name("RESERVED5")
    1044                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("RESERVED5")
    1045                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   20

    1046                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1047                            .dwattr $C$DW$58, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1048                            .dwattr $C$DW$58, DW_AT_decl_line(0x293)
    1049                            .dwattr $C$DW$58, DW_AT_decl_column(0x0b)
    1050                    
    1051                    $C$DW$59        .dwtag  DW_TAG_member
    1052                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$24)
    1053                            .dwattr $C$DW$59, DW_AT_name("SEL1")
    1054                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("SEL1")
    1055                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1056                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1057                            .dwattr $C$DW$59, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1058                            .dwattr $C$DW$59, DW_AT_decl_line(0x294)
    1059                            .dwattr $C$DW$59, DW_AT_decl_column(0x10)
    1060                    
    1061                    $C$DW$60        .dwtag  DW_TAG_member
    1062                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
    1063                            .dwattr $C$DW$60, DW_AT_name("RESERVED6")
    1064                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("RESERVED6")
    1065                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1066                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1067                            .dwattr $C$DW$60, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1068                            .dwattr $C$DW$60, DW_AT_decl_line(0x295)
    1069                            .dwattr $C$DW$60, DW_AT_decl_column(0x0b)
    1070                    
    1071                    $C$DW$61        .dwtag  DW_TAG_member
    1072                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$27)
    1073                            .dwattr $C$DW$61, DW_AT_name("IV")
    1074                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("IV")
    1075                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1076                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1077                            .dwattr $C$DW$61, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1078                            .dwattr $C$DW$61, DW_AT_decl_line(0x296)
    1079                            .dwattr $C$DW$61, DW_AT_decl_column(0x11)
    1080                    
    1081                    $C$DW$62        .dwtag  DW_TAG_member
    1082                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$28)
    1083                            .dwattr $C$DW$62, DW_AT_name("RESERVED7")
    1084                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("RESERVED7")
    1085                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1086                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1087                            .dwattr $C$DW$62, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1088                            .dwattr $C$DW$62, DW_AT_decl_line(0x297)
    1089                            .dwattr $C$DW$62, DW_AT_decl_column(0x0b)
    1090                    
    1091                    $C$DW$63        .dwtag  DW_TAG_member
    1092                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$24)
    1093                            .dwattr $C$DW$63, DW_AT_name("SELC")
    1094                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("SELC")
    1095                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1096                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1097                            .dwattr $C$DW$63, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1098                            .dwattr $C$DW$63, DW_AT_decl_line(0x298)
    1099                            .dwattr $C$DW$63, DW_AT_decl_column(0x10)
    1100                    
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   21

    1101                    $C$DW$64        .dwtag  DW_TAG_member
    1102                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
    1103                            .dwattr $C$DW$64, DW_AT_name("RESERVED8")
    1104                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("RESERVED8")
    1105                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1106                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1107                            .dwattr $C$DW$64, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1108                            .dwattr $C$DW$64, DW_AT_decl_line(0x299)
    1109                            .dwattr $C$DW$64, DW_AT_decl_column(0x0b)
    1110                    
    1111                    $C$DW$65        .dwtag  DW_TAG_member
    1112                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$24)
    1113                            .dwattr $C$DW$65, DW_AT_name("IES")
    1114                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("IES")
    1115                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1116                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1117                            .dwattr $C$DW$65, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1118                            .dwattr $C$DW$65, DW_AT_decl_line(0x29a)
    1119                            .dwattr $C$DW$65, DW_AT_decl_column(0x10)
    1120                    
    1121                    $C$DW$66        .dwtag  DW_TAG_member
    1122                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1123                            .dwattr $C$DW$66, DW_AT_name("RESERVED9")
    1124                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("RESERVED9")
    1125                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1126                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1127                            .dwattr $C$DW$66, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1128                            .dwattr $C$DW$66, DW_AT_decl_line(0x29b)
    1129                            .dwattr $C$DW$66, DW_AT_decl_column(0x0b)
    1130                    
    1131                    $C$DW$67        .dwtag  DW_TAG_member
    1132                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$24)
    1133                            .dwattr $C$DW$67, DW_AT_name("IE")
    1134                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("IE")
    1135                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1136                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1137                            .dwattr $C$DW$67, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1138                            .dwattr $C$DW$67, DW_AT_decl_line(0x29c)
    1139                            .dwattr $C$DW$67, DW_AT_decl_column(0x10)
    1140                    
    1141                    $C$DW$68        .dwtag  DW_TAG_member
    1142                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
    1143                            .dwattr $C$DW$68, DW_AT_name("RESERVED10")
    1144                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("RESERVED10")
    1145                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1146                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1147                            .dwattr $C$DW$68, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1148                            .dwattr $C$DW$68, DW_AT_decl_line(0x29d)
    1149                            .dwattr $C$DW$68, DW_AT_decl_column(0x0b)
    1150                    
    1151                    $C$DW$69        .dwtag  DW_TAG_member
    1152                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$24)
    1153                            .dwattr $C$DW$69, DW_AT_name("IFG")
    1154                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("IFG")
    1155                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   22

    1156                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1157                            .dwattr $C$DW$69, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1158                            .dwattr $C$DW$69, DW_AT_decl_line(0x29e)
    1159                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1160                    
    1161                    $C$DW$70        .dwtag  DW_TAG_member
    1162                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
    1163                            .dwattr $C$DW$70, DW_AT_name("RESERVED11")
    1164                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("RESERVED11")
    1165                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1166                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1167                            .dwattr $C$DW$70, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1168                            .dwattr $C$DW$70, DW_AT_decl_line(0x29f)
    1169                            .dwattr $C$DW$70, DW_AT_decl_column(0x0b)
    1170                    
    1171                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1172                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x287)
    1173                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    1174                            .dwendtag $C$DW$T$29
    1175                    
    1176                    $C$DW$T$179     .dwtag  DW_TAG_typedef
    1177                            .dwattr $C$DW$T$179, DW_AT_name("DIO_PORT_Odd_Interruptable_Type")
    1178                            .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$29)
    1179                            .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    1180                            .dwattr $C$DW$T$179, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1181                            .dwattr $C$DW$T$179, DW_AT_decl_line(0x2a0)
    1182                            .dwattr $C$DW$T$179, DW_AT_decl_column(0x03)
    1183                    
    1184                    
    1185                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1186                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x20)
    1187                    $C$DW$71        .dwtag  DW_TAG_member
    1188                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
    1189                            .dwattr $C$DW$71, DW_AT_name("RESERVED0")
    1190                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("RESERVED0")
    1191                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1193                            .dwattr $C$DW$71, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1194                            .dwattr $C$DW$71, DW_AT_decl_line(0x2a3)
    1195                            .dwattr $C$DW$71, DW_AT_decl_column(0x0b)
    1196                    
    1197                    $C$DW$72        .dwtag  DW_TAG_member
    1198                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$23)
    1199                            .dwattr $C$DW$72, DW_AT_name("IN")
    1200                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("IN")
    1201                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1202                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1203                            .dwattr $C$DW$72, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1204                            .dwattr $C$DW$72, DW_AT_decl_line(0x2a4)
    1205                            .dwattr $C$DW$72, DW_AT_decl_column(0x0f)
    1206                    
    1207                    $C$DW$73        .dwtag  DW_TAG_member
    1208                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
    1209                            .dwattr $C$DW$73, DW_AT_name("RESERVED1")
    1210                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("RESERVED1")
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   23

    1211                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1212                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1213                            .dwattr $C$DW$73, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1214                            .dwattr $C$DW$73, DW_AT_decl_line(0x2a5)
    1215                            .dwattr $C$DW$73, DW_AT_decl_column(0x0b)
    1216                    
    1217                    $C$DW$74        .dwtag  DW_TAG_member
    1218                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$24)
    1219                            .dwattr $C$DW$74, DW_AT_name("OUT")
    1220                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("OUT")
    1221                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1222                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1223                            .dwattr $C$DW$74, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1224                            .dwattr $C$DW$74, DW_AT_decl_line(0x2a6)
    1225                            .dwattr $C$DW$74, DW_AT_decl_column(0x10)
    1226                    
    1227                    $C$DW$75        .dwtag  DW_TAG_member
    1228                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
    1229                            .dwattr $C$DW$75, DW_AT_name("RESERVED2")
    1230                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("RESERVED2")
    1231                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1232                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1233                            .dwattr $C$DW$75, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1234                            .dwattr $C$DW$75, DW_AT_decl_line(0x2a7)
    1235                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1236                    
    1237                    $C$DW$76        .dwtag  DW_TAG_member
    1238                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$24)
    1239                            .dwattr $C$DW$76, DW_AT_name("DIR")
    1240                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("DIR")
    1241                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1242                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1243                            .dwattr $C$DW$76, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1244                            .dwattr $C$DW$76, DW_AT_decl_line(0x2a8)
    1245                            .dwattr $C$DW$76, DW_AT_decl_column(0x10)
    1246                    
    1247                    $C$DW$77        .dwtag  DW_TAG_member
    1248                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
    1249                            .dwattr $C$DW$77, DW_AT_name("RESERVED3")
    1250                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("RESERVED3")
    1251                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1252                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1253                            .dwattr $C$DW$77, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1254                            .dwattr $C$DW$77, DW_AT_decl_line(0x2a9)
    1255                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1256                    
    1257                    $C$DW$78        .dwtag  DW_TAG_member
    1258                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$24)
    1259                            .dwattr $C$DW$78, DW_AT_name("REN")
    1260                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("REN")
    1261                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1262                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1263                            .dwattr $C$DW$78, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1264                            .dwattr $C$DW$78, DW_AT_decl_line(0x2aa)
    1265                            .dwattr $C$DW$78, DW_AT_decl_column(0x10)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   24

    1266                    
    1267                    $C$DW$79        .dwtag  DW_TAG_member
    1268                            .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
    1269                            .dwattr $C$DW$79, DW_AT_name("RESERVED4")
    1270                            .dwattr $C$DW$79, DW_AT_TI_symbol_name("RESERVED4")
    1271                            .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1272                            .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1273                            .dwattr $C$DW$79, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1274                            .dwattr $C$DW$79, DW_AT_decl_line(0x2ab)
    1275                            .dwattr $C$DW$79, DW_AT_decl_column(0x0b)
    1276                    
    1277                    $C$DW$80        .dwtag  DW_TAG_member
    1278                            .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$24)
    1279                            .dwattr $C$DW$80, DW_AT_name("DS")
    1280                            .dwattr $C$DW$80, DW_AT_TI_symbol_name("DS")
    1281                            .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1282                            .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1283                            .dwattr $C$DW$80, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1284                            .dwattr $C$DW$80, DW_AT_decl_line(0x2ac)
    1285                            .dwattr $C$DW$80, DW_AT_decl_column(0x10)
    1286                    
    1287                    $C$DW$81        .dwtag  DW_TAG_member
    1288                            .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
    1289                            .dwattr $C$DW$81, DW_AT_name("RESERVED5")
    1290                            .dwattr $C$DW$81, DW_AT_TI_symbol_name("RESERVED5")
    1291                            .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1292                            .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1293                            .dwattr $C$DW$81, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1294                            .dwattr $C$DW$81, DW_AT_decl_line(0x2ad)
    1295                            .dwattr $C$DW$81, DW_AT_decl_column(0x0b)
    1296                    
    1297                    $C$DW$82        .dwtag  DW_TAG_member
    1298                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$24)
    1299                            .dwattr $C$DW$82, DW_AT_name("SEL0")
    1300                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("SEL0")
    1301                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1302                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1303                            .dwattr $C$DW$82, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1304                            .dwattr $C$DW$82, DW_AT_decl_line(0x2ae)
    1305                            .dwattr $C$DW$82, DW_AT_decl_column(0x10)
    1306                    
    1307                    $C$DW$83        .dwtag  DW_TAG_member
    1308                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
    1309                            .dwattr $C$DW$83, DW_AT_name("RESERVED6")
    1310                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("RESERVED6")
    1311                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1312                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1313                            .dwattr $C$DW$83, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1314                            .dwattr $C$DW$83, DW_AT_decl_line(0x2af)
    1315                            .dwattr $C$DW$83, DW_AT_decl_column(0x0b)
    1316                    
    1317                    $C$DW$84        .dwtag  DW_TAG_member
    1318                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
    1319                            .dwattr $C$DW$84, DW_AT_name("SEL1")
    1320                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("SEL1")
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   25

    1321                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1322                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1323                            .dwattr $C$DW$84, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1324                            .dwattr $C$DW$84, DW_AT_decl_line(0x2b0)
    1325                            .dwattr $C$DW$84, DW_AT_decl_column(0x10)
    1326                    
    1327                    $C$DW$85        .dwtag  DW_TAG_member
    1328                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$30)
    1329                            .dwattr $C$DW$85, DW_AT_name("RESERVED7")
    1330                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("RESERVED7")
    1331                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1332                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1333                            .dwattr $C$DW$85, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1334                            .dwattr $C$DW$85, DW_AT_decl_line(0x2b1)
    1335                            .dwattr $C$DW$85, DW_AT_decl_column(0x0b)
    1336                    
    1337                    $C$DW$86        .dwtag  DW_TAG_member
    1338                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$24)
    1339                            .dwattr $C$DW$86, DW_AT_name("SELC")
    1340                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("SELC")
    1341                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1342                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1343                            .dwattr $C$DW$86, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1344                            .dwattr $C$DW$86, DW_AT_decl_line(0x2b2)
    1345                            .dwattr $C$DW$86, DW_AT_decl_column(0x10)
    1346                    
    1347                    $C$DW$87        .dwtag  DW_TAG_member
    1348                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
    1349                            .dwattr $C$DW$87, DW_AT_name("RESERVED8")
    1350                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("RESERVED8")
    1351                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1352                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1353                            .dwattr $C$DW$87, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1354                            .dwattr $C$DW$87, DW_AT_decl_line(0x2b3)
    1355                            .dwattr $C$DW$87, DW_AT_decl_column(0x0b)
    1356                    
    1357                    $C$DW$88        .dwtag  DW_TAG_member
    1358                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$24)
    1359                            .dwattr $C$DW$88, DW_AT_name("IES")
    1360                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("IES")
    1361                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1362                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1363                            .dwattr $C$DW$88, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1364                            .dwattr $C$DW$88, DW_AT_decl_line(0x2b4)
    1365                            .dwattr $C$DW$88, DW_AT_decl_column(0x10)
    1366                    
    1367                    $C$DW$89        .dwtag  DW_TAG_member
    1368                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
    1369                            .dwattr $C$DW$89, DW_AT_name("RESERVED9")
    1370                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("RESERVED9")
    1371                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1372                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1373                            .dwattr $C$DW$89, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1374                            .dwattr $C$DW$89, DW_AT_decl_line(0x2b5)
    1375                            .dwattr $C$DW$89, DW_AT_decl_column(0x0b)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   26

    1376                    
    1377                    $C$DW$90        .dwtag  DW_TAG_member
    1378                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$24)
    1379                            .dwattr $C$DW$90, DW_AT_name("IE")
    1380                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("IE")
    1381                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1382                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1383                            .dwattr $C$DW$90, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1384                            .dwattr $C$DW$90, DW_AT_decl_line(0x2b6)
    1385                            .dwattr $C$DW$90, DW_AT_decl_column(0x10)
    1386                    
    1387                    $C$DW$91        .dwtag  DW_TAG_member
    1388                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
    1389                            .dwattr $C$DW$91, DW_AT_name("RESERVED10")
    1390                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("RESERVED10")
    1391                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1392                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1393                            .dwattr $C$DW$91, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1394                            .dwattr $C$DW$91, DW_AT_decl_line(0x2b7)
    1395                            .dwattr $C$DW$91, DW_AT_decl_column(0x0b)
    1396                    
    1397                    $C$DW$92        .dwtag  DW_TAG_member
    1398                            .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
    1399                            .dwattr $C$DW$92, DW_AT_name("IFG")
    1400                            .dwattr $C$DW$92, DW_AT_TI_symbol_name("IFG")
    1401                            .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1402                            .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1403                            .dwattr $C$DW$92, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1404                            .dwattr $C$DW$92, DW_AT_decl_line(0x2b8)
    1405                            .dwattr $C$DW$92, DW_AT_decl_column(0x10)
    1406                    
    1407                    $C$DW$93        .dwtag  DW_TAG_member
    1408                            .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$27)
    1409                            .dwattr $C$DW$93, DW_AT_name("IV")
    1410                            .dwattr $C$DW$93, DW_AT_TI_symbol_name("IV")
    1411                            .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1412                            .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1413                            .dwattr $C$DW$93, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1414                            .dwattr $C$DW$93, DW_AT_decl_line(0x2b9)
    1415                            .dwattr $C$DW$93, DW_AT_decl_column(0x10)
    1416                    
    1417                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1418                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2a2)
    1419                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1420                            .dwendtag $C$DW$T$31
    1421                    
    1422                    $C$DW$T$181     .dwtag  DW_TAG_typedef
    1423                            .dwattr $C$DW$T$181, DW_AT_name("DIO_PORT_Even_Interruptable_Type")
    1424                            .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$31)
    1425                            .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    1426                            .dwattr $C$DW$T$181, DW_AT_decl_file("C:\ti\ccs2020\ccs\ccs_base\arm\include\msp432p401r.h")
    1427                            .dwattr $C$DW$T$181, DW_AT_decl_line(0x2ba)
    1428                            .dwattr $C$DW$T$181, DW_AT_decl_column(0x03)
    1429                    
    1430                    
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   27

    1431                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1432                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    1433                    $C$DW$94        .dwtag  DW_TAG_member
    1434                            .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$14)
    1435                            .dwattr $C$DW$94, DW_AT_name("__max_align1")
    1436                            .dwattr $C$DW$94, DW_AT_TI_symbol_name("__max_align1")
    1437                            .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                            .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1439                            .dwattr $C$DW$94, DW_AT_decl_file("C:/ti/ccs2020/ccs/tools/compiler/include/sys/_types.h")
    1440                            .dwattr $C$DW$94, DW_AT_decl_line(0x7b)
    1441                            .dwattr $C$DW$94, DW_AT_decl_column(0x0c)
    1442                    
    1443                    $C$DW$95        .dwtag  DW_TAG_member
    1444                            .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$18)
    1445                            .dwattr $C$DW$95, DW_AT_name("__max_align2")
    1446                            .dwattr $C$DW$95, DW_AT_TI_symbol_name("__max_align2")
    1447                            .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1448                            .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1449                            .dwattr $C$DW$95, DW_AT_decl_file("C:/ti/ccs2020/ccs/tools/compiler/include/sys/_types.h")
    1450                            .dwattr $C$DW$95, DW_AT_decl_line(0x7c)
    1451                            .dwattr $C$DW$95, DW_AT_decl_column(0x0e)
    1452                    
    1453                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/ti/ccs2020/ccs/tools/compiler/include/sys/_types.h")
    1454                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7a)
    1455                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    1456                            .dwendtag $C$DW$T$32
    1457                    
    1458                    $C$DW$T$183     .dwtag  DW_TAG_typedef
    1459                            .dwattr $C$DW$T$183, DW_AT_name("__max_align_t")
    1460                            .dwattr $C$DW$T$183, DW_AT_type(*$C$DW$T$32)
    1461                            .dwattr $C$DW$T$183, DW_AT_language(DW_LANG_C)
    1462                            .dwattr $C$DW$T$183, DW_AT_decl_file("C:/ti/ccs2020/ccs/tools/compiler/include/sys/_types.h")
    1463                            .dwattr $C$DW$T$183, DW_AT_decl_line(0x7d)
    1464                            .dwattr $C$DW$T$183, DW_AT_decl_column(0x03)
    1465                    
    1466                    
    1467                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1468                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    1469                    $C$DW$96        .dwtag  DW_TAG_member
    1470                            .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$34)
    1471                            .dwattr $C$DW$96, DW_AT_name("_reserved0")
    1472                            .dwattr $C$DW$96, DW_AT_TI_symbol_name("_reserved0")
    1473                            .dwattr $C$DW$96, DW_AT_bit_offset(0x10)
    1474                            .dwattr $C$DW$96, DW_AT_bit_size(0x10)
    1475                            .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                            .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1477                            .dwattr $C$DW$96, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1478                            .dwattr $C$DW$96, DW_AT_decl_line(0x105)
    1479                            .dwattr $C$DW$96, DW_AT_decl_column(0x0e)
    1480                    
    1481                    $C$DW$97        .dwtag  DW_TAG_member
    1482                            .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$34)
    1483                            .dwattr $C$DW$97, DW_AT_name("GE")
    1484                            .dwattr $C$DW$97, DW_AT_TI_symbol_name("GE")
    1485                            .dwattr $C$DW$97, DW_AT_bit_offset(0x0c)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   28

    1486                            .dwattr $C$DW$97, DW_AT_bit_size(0x04)
    1487                            .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                            .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1489                            .dwattr $C$DW$97, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1490                            .dwattr $C$DW$97, DW_AT_decl_line(0x106)
    1491                            .dwattr $C$DW$97, DW_AT_decl_column(0x0e)
    1492                    
    1493                    $C$DW$98        .dwtag  DW_TAG_member
    1494                            .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$34)
    1495                            .dwattr $C$DW$98, DW_AT_name("_reserved1")
    1496                            .dwattr $C$DW$98, DW_AT_TI_symbol_name("_reserved1")
    1497                            .dwattr $C$DW$98, DW_AT_bit_offset(0x05)
    1498                            .dwattr $C$DW$98, DW_AT_bit_size(0x07)
    1499                            .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                            .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1501                            .dwattr $C$DW$98, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1502                            .dwattr $C$DW$98, DW_AT_decl_line(0x107)
    1503                            .dwattr $C$DW$98, DW_AT_decl_column(0x0e)
    1504                    
    1505                    $C$DW$99        .dwtag  DW_TAG_member
    1506                            .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1507                            .dwattr $C$DW$99, DW_AT_name("Q")
    1508                            .dwattr $C$DW$99, DW_AT_TI_symbol_name("Q")
    1509                            .dwattr $C$DW$99, DW_AT_bit_offset(0x04)
    1510                            .dwattr $C$DW$99, DW_AT_bit_size(0x01)
    1511                            .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                            .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1513                            .dwattr $C$DW$99, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1514                            .dwattr $C$DW$99, DW_AT_decl_line(0x108)
    1515                            .dwattr $C$DW$99, DW_AT_decl_column(0x0e)
    1516                    
    1517                    $C$DW$100       .dwtag  DW_TAG_member
    1518                            .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$34)
    1519                            .dwattr $C$DW$100, DW_AT_name("V")
    1520                            .dwattr $C$DW$100, DW_AT_TI_symbol_name("V")
    1521                            .dwattr $C$DW$100, DW_AT_bit_offset(0x03)
    1522                            .dwattr $C$DW$100, DW_AT_bit_size(0x01)
    1523                            .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                            .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwattr $C$DW$100, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1526                            .dwattr $C$DW$100, DW_AT_decl_line(0x109)
    1527                            .dwattr $C$DW$100, DW_AT_decl_column(0x0e)
    1528                    
    1529                    $C$DW$101       .dwtag  DW_TAG_member
    1530                            .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$34)
    1531                            .dwattr $C$DW$101, DW_AT_name("C")
    1532                            .dwattr $C$DW$101, DW_AT_TI_symbol_name("C")
    1533                            .dwattr $C$DW$101, DW_AT_bit_offset(0x02)
    1534                            .dwattr $C$DW$101, DW_AT_bit_size(0x01)
    1535                            .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                            .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1537                            .dwattr $C$DW$101, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1538                            .dwattr $C$DW$101, DW_AT_decl_line(0x10a)
    1539                            .dwattr $C$DW$101, DW_AT_decl_column(0x0e)
    1540                    
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   29

    1541                    $C$DW$102       .dwtag  DW_TAG_member
    1542                            .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$34)
    1543                            .dwattr $C$DW$102, DW_AT_name("Z")
    1544                            .dwattr $C$DW$102, DW_AT_TI_symbol_name("Z")
    1545                            .dwattr $C$DW$102, DW_AT_bit_offset(0x01)
    1546                            .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    1547                            .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                            .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1549                            .dwattr $C$DW$102, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1550                            .dwattr $C$DW$102, DW_AT_decl_line(0x10b)
    1551                            .dwattr $C$DW$102, DW_AT_decl_column(0x0e)
    1552                    
    1553                    $C$DW$103       .dwtag  DW_TAG_member
    1554                            .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$34)
    1555                            .dwattr $C$DW$103, DW_AT_name("N")
    1556                            .dwattr $C$DW$103, DW_AT_TI_symbol_name("N")
    1557                            .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    1558                            .dwattr $C$DW$103, DW_AT_bit_size(0x01)
    1559                            .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                            .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1561                            .dwattr $C$DW$103, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1562                            .dwattr $C$DW$103, DW_AT_decl_line(0x10c)
    1563                            .dwattr $C$DW$103, DW_AT_decl_column(0x0e)
    1564                    
    1565                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1566                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x104)
    1567                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x03)
    1568                            .dwendtag $C$DW$T$35
    1569                    
    1570                    
    1571                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1572                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1573                    $C$DW$104       .dwtag  DW_TAG_member
    1574                            .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$34)
    1575                            .dwattr $C$DW$104, DW_AT_name("ISR")
    1576                            .dwattr $C$DW$104, DW_AT_TI_symbol_name("ISR")
    1577                            .dwattr $C$DW$104, DW_AT_bit_offset(0x17)
    1578                            .dwattr $C$DW$104, DW_AT_bit_size(0x09)
    1579                            .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                            .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1581                            .dwattr $C$DW$104, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1582                            .dwattr $C$DW$104, DW_AT_decl_line(0x12c)
    1583                            .dwattr $C$DW$104, DW_AT_decl_column(0x0e)
    1584                    
    1585                    $C$DW$105       .dwtag  DW_TAG_member
    1586                            .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$34)
    1587                            .dwattr $C$DW$105, DW_AT_name("_reserved0")
    1588                            .dwattr $C$DW$105, DW_AT_TI_symbol_name("_reserved0")
    1589                            .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    1590                            .dwattr $C$DW$105, DW_AT_bit_size(0x17)
    1591                            .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592                            .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1593                            .dwattr $C$DW$105, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1594                            .dwattr $C$DW$105, DW_AT_decl_line(0x12d)
    1595                            .dwattr $C$DW$105, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   30

    1596                    
    1597                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1598                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x12b)
    1599                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
    1600                            .dwendtag $C$DW$T$36
    1601                    
    1602                    
    1603                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1604                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1605                    $C$DW$106       .dwtag  DW_TAG_member
    1606                            .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$34)
    1607                            .dwattr $C$DW$106, DW_AT_name("ISR")
    1608                            .dwattr $C$DW$106, DW_AT_TI_symbol_name("ISR")
    1609                            .dwattr $C$DW$106, DW_AT_bit_offset(0x17)
    1610                            .dwattr $C$DW$106, DW_AT_bit_size(0x09)
    1611                            .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612                            .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1613                            .dwattr $C$DW$106, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1614                            .dwattr $C$DW$106, DW_AT_decl_line(0x13e)
    1615                            .dwattr $C$DW$106, DW_AT_decl_column(0x0e)
    1616                    
    1617                    $C$DW$107       .dwtag  DW_TAG_member
    1618                            .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$34)
    1619                            .dwattr $C$DW$107, DW_AT_name("_reserved0")
    1620                            .dwattr $C$DW$107, DW_AT_TI_symbol_name("_reserved0")
    1621                            .dwattr $C$DW$107, DW_AT_bit_offset(0x16)
    1622                            .dwattr $C$DW$107, DW_AT_bit_size(0x01)
    1623                            .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1624                            .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1625                            .dwattr $C$DW$107, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1626                            .dwattr $C$DW$107, DW_AT_decl_line(0x13f)
    1627                            .dwattr $C$DW$107, DW_AT_decl_column(0x0e)
    1628                    
    1629                    $C$DW$108       .dwtag  DW_TAG_member
    1630                            .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$34)
    1631                            .dwattr $C$DW$108, DW_AT_name("ICI_IT_1")
    1632                            .dwattr $C$DW$108, DW_AT_TI_symbol_name("ICI_IT_1")
    1633                            .dwattr $C$DW$108, DW_AT_bit_offset(0x10)
    1634                            .dwattr $C$DW$108, DW_AT_bit_size(0x06)
    1635                            .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                            .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1637                            .dwattr $C$DW$108, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1638                            .dwattr $C$DW$108, DW_AT_decl_line(0x140)
    1639                            .dwattr $C$DW$108, DW_AT_decl_column(0x0e)
    1640                    
    1641                    $C$DW$109       .dwtag  DW_TAG_member
    1642                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$34)
    1643                            .dwattr $C$DW$109, DW_AT_name("GE")
    1644                            .dwattr $C$DW$109, DW_AT_TI_symbol_name("GE")
    1645                            .dwattr $C$DW$109, DW_AT_bit_offset(0x0c)
    1646                            .dwattr $C$DW$109, DW_AT_bit_size(0x04)
    1647                            .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                            .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1649                            .dwattr $C$DW$109, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1650                            .dwattr $C$DW$109, DW_AT_decl_line(0x141)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   31

    1651                            .dwattr $C$DW$109, DW_AT_decl_column(0x0e)
    1652                    
    1653                    $C$DW$110       .dwtag  DW_TAG_member
    1654                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$34)
    1655                            .dwattr $C$DW$110, DW_AT_name("_reserved1")
    1656                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("_reserved1")
    1657                            .dwattr $C$DW$110, DW_AT_bit_offset(0x08)
    1658                            .dwattr $C$DW$110, DW_AT_bit_size(0x04)
    1659                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1661                            .dwattr $C$DW$110, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1662                            .dwattr $C$DW$110, DW_AT_decl_line(0x142)
    1663                            .dwattr $C$DW$110, DW_AT_decl_column(0x0e)
    1664                    
    1665                    $C$DW$111       .dwtag  DW_TAG_member
    1666                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$34)
    1667                            .dwattr $C$DW$111, DW_AT_name("T")
    1668                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("T")
    1669                            .dwattr $C$DW$111, DW_AT_bit_offset(0x07)
    1670                            .dwattr $C$DW$111, DW_AT_bit_size(0x01)
    1671                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1673                            .dwattr $C$DW$111, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1674                            .dwattr $C$DW$111, DW_AT_decl_line(0x143)
    1675                            .dwattr $C$DW$111, DW_AT_decl_column(0x0e)
    1676                    
    1677                    $C$DW$112       .dwtag  DW_TAG_member
    1678                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
    1679                            .dwattr $C$DW$112, DW_AT_name("ICI_IT_2")
    1680                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("ICI_IT_2")
    1681                            .dwattr $C$DW$112, DW_AT_bit_offset(0x05)
    1682                            .dwattr $C$DW$112, DW_AT_bit_size(0x02)
    1683                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwattr $C$DW$112, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1686                            .dwattr $C$DW$112, DW_AT_decl_line(0x144)
    1687                            .dwattr $C$DW$112, DW_AT_decl_column(0x0e)
    1688                    
    1689                    $C$DW$113       .dwtag  DW_TAG_member
    1690                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$34)
    1691                            .dwattr $C$DW$113, DW_AT_name("Q")
    1692                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("Q")
    1693                            .dwattr $C$DW$113, DW_AT_bit_offset(0x04)
    1694                            .dwattr $C$DW$113, DW_AT_bit_size(0x01)
    1695                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1696                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1697                            .dwattr $C$DW$113, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1698                            .dwattr $C$DW$113, DW_AT_decl_line(0x145)
    1699                            .dwattr $C$DW$113, DW_AT_decl_column(0x0e)
    1700                    
    1701                    $C$DW$114       .dwtag  DW_TAG_member
    1702                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$34)
    1703                            .dwattr $C$DW$114, DW_AT_name("V")
    1704                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("V")
    1705                            .dwattr $C$DW$114, DW_AT_bit_offset(0x03)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   32

    1706                            .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    1707                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$114, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1710                            .dwattr $C$DW$114, DW_AT_decl_line(0x146)
    1711                            .dwattr $C$DW$114, DW_AT_decl_column(0x0e)
    1712                    
    1713                    $C$DW$115       .dwtag  DW_TAG_member
    1714                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$34)
    1715                            .dwattr $C$DW$115, DW_AT_name("C")
    1716                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("C")
    1717                            .dwattr $C$DW$115, DW_AT_bit_offset(0x02)
    1718                            .dwattr $C$DW$115, DW_AT_bit_size(0x01)
    1719                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1720                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1721                            .dwattr $C$DW$115, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1722                            .dwattr $C$DW$115, DW_AT_decl_line(0x147)
    1723                            .dwattr $C$DW$115, DW_AT_decl_column(0x0e)
    1724                    
    1725                    $C$DW$116       .dwtag  DW_TAG_member
    1726                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$34)
    1727                            .dwattr $C$DW$116, DW_AT_name("Z")
    1728                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("Z")
    1729                            .dwattr $C$DW$116, DW_AT_bit_offset(0x01)
    1730                            .dwattr $C$DW$116, DW_AT_bit_size(0x01)
    1731                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwattr $C$DW$116, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1734                            .dwattr $C$DW$116, DW_AT_decl_line(0x148)
    1735                            .dwattr $C$DW$116, DW_AT_decl_column(0x0e)
    1736                    
    1737                    $C$DW$117       .dwtag  DW_TAG_member
    1738                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$34)
    1739                            .dwattr $C$DW$117, DW_AT_name("N")
    1740                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("N")
    1741                            .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    1742                            .dwattr $C$DW$117, DW_AT_bit_size(0x01)
    1743                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1745                            .dwattr $C$DW$117, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1746                            .dwattr $C$DW$117, DW_AT_decl_line(0x149)
    1747                            .dwattr $C$DW$117, DW_AT_decl_column(0x0e)
    1748                    
    1749                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1750                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x13d)
    1751                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x03)
    1752                            .dwendtag $C$DW$T$37
    1753                    
    1754                    
    1755                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1756                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1757                    $C$DW$118       .dwtag  DW_TAG_member
    1758                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$34)
    1759                            .dwattr $C$DW$118, DW_AT_name("nPRIV")
    1760                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("nPRIV")
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   33

    1761                            .dwattr $C$DW$118, DW_AT_bit_offset(0x1f)
    1762                            .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    1763                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1765                            .dwattr $C$DW$118, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1766                            .dwattr $C$DW$118, DW_AT_decl_line(0x175)
    1767                            .dwattr $C$DW$118, DW_AT_decl_column(0x0e)
    1768                    
    1769                    $C$DW$119       .dwtag  DW_TAG_member
    1770                            .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$34)
    1771                            .dwattr $C$DW$119, DW_AT_name("SPSEL")
    1772                            .dwattr $C$DW$119, DW_AT_TI_symbol_name("SPSEL")
    1773                            .dwattr $C$DW$119, DW_AT_bit_offset(0x1e)
    1774                            .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    1775                            .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                            .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1777                            .dwattr $C$DW$119, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1778                            .dwattr $C$DW$119, DW_AT_decl_line(0x176)
    1779                            .dwattr $C$DW$119, DW_AT_decl_column(0x0e)
    1780                    
    1781                    $C$DW$120       .dwtag  DW_TAG_member
    1782                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$34)
    1783                            .dwattr $C$DW$120, DW_AT_name("FPCA")
    1784                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("FPCA")
    1785                            .dwattr $C$DW$120, DW_AT_bit_offset(0x1d)
    1786                            .dwattr $C$DW$120, DW_AT_bit_size(0x01)
    1787                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1789                            .dwattr $C$DW$120, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1790                            .dwattr $C$DW$120, DW_AT_decl_line(0x177)
    1791                            .dwattr $C$DW$120, DW_AT_decl_column(0x0e)
    1792                    
    1793                    $C$DW$121       .dwtag  DW_TAG_member
    1794                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$34)
    1795                            .dwattr $C$DW$121, DW_AT_name("_reserved0")
    1796                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("_reserved0")
    1797                            .dwattr $C$DW$121, DW_AT_bit_offset(0x00)
    1798                            .dwattr $C$DW$121, DW_AT_bit_size(0x1d)
    1799                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1801                            .dwattr $C$DW$121, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1802                            .dwattr $C$DW$121, DW_AT_decl_line(0x178)
    1803                            .dwattr $C$DW$121, DW_AT_decl_column(0x0e)
    1804                    
    1805                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1806                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x174)
    1807                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x03)
    1808                            .dwendtag $C$DW$T$38
    1809                    
    1810                    
    1811                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1812                            .dwattr $C$DW$T$45, DW_AT_byte_size(0xe04)
    1813                    $C$DW$122       .dwtag  DW_TAG_member
    1814                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$40)
    1815                            .dwattr $C$DW$122, DW_AT_name("ISER")
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   34

    1816                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("ISER")
    1817                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1819                            .dwattr $C$DW$122, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1820                            .dwattr $C$DW$122, DW_AT_decl_line(0x196)
    1821                            .dwattr $C$DW$122, DW_AT_decl_column(0x12)
    1822                    
    1823                    $C$DW$123       .dwtag  DW_TAG_member
    1824                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$41)
    1825                            .dwattr $C$DW$123, DW_AT_name("RESERVED0")
    1826                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("RESERVED0")
    1827                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1828                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1829                            .dwattr $C$DW$123, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1830                            .dwattr $C$DW$123, DW_AT_decl_line(0x197)
    1831                            .dwattr $C$DW$123, DW_AT_decl_column(0x12)
    1832                    
    1833                    $C$DW$124       .dwtag  DW_TAG_member
    1834                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$40)
    1835                            .dwattr $C$DW$124, DW_AT_name("ICER")
    1836                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("ICER")
    1837                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1838                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1839                            .dwattr $C$DW$124, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1840                            .dwattr $C$DW$124, DW_AT_decl_line(0x198)
    1841                            .dwattr $C$DW$124, DW_AT_decl_column(0x12)
    1842                    
    1843                    $C$DW$125       .dwtag  DW_TAG_member
    1844                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$41)
    1845                            .dwattr $C$DW$125, DW_AT_name("RSERVED1")
    1846                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("RSERVED1")
    1847                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1848                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1849                            .dwattr $C$DW$125, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1850                            .dwattr $C$DW$125, DW_AT_decl_line(0x199)
    1851                            .dwattr $C$DW$125, DW_AT_decl_column(0x12)
    1852                    
    1853                    $C$DW$126       .dwtag  DW_TAG_member
    1854                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$40)
    1855                            .dwattr $C$DW$126, DW_AT_name("ISPR")
    1856                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("ISPR")
    1857                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
    1858                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwattr $C$DW$126, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1860                            .dwattr $C$DW$126, DW_AT_decl_line(0x19a)
    1861                            .dwattr $C$DW$126, DW_AT_decl_column(0x12)
    1862                    
    1863                    $C$DW$127       .dwtag  DW_TAG_member
    1864                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$41)
    1865                            .dwattr $C$DW$127, DW_AT_name("RESERVED2")
    1866                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("RESERVED2")
    1867                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
    1868                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$127, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1870                            .dwattr $C$DW$127, DW_AT_decl_line(0x19b)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   35

    1871                            .dwattr $C$DW$127, DW_AT_decl_column(0x12)
    1872                    
    1873                    $C$DW$128       .dwtag  DW_TAG_member
    1874                            .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$40)
    1875                            .dwattr $C$DW$128, DW_AT_name("ICPR")
    1876                            .dwattr $C$DW$128, DW_AT_TI_symbol_name("ICPR")
    1877                            .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    1878                            .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1879                            .dwattr $C$DW$128, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1880                            .dwattr $C$DW$128, DW_AT_decl_line(0x19c)
    1881                            .dwattr $C$DW$128, DW_AT_decl_column(0x12)
    1882                    
    1883                    $C$DW$129       .dwtag  DW_TAG_member
    1884                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$41)
    1885                            .dwattr $C$DW$129, DW_AT_name("RESERVED3")
    1886                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("RESERVED3")
    1887                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
    1888                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwattr $C$DW$129, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1890                            .dwattr $C$DW$129, DW_AT_decl_line(0x19d)
    1891                            .dwattr $C$DW$129, DW_AT_decl_column(0x12)
    1892                    
    1893                    $C$DW$130       .dwtag  DW_TAG_member
    1894                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$40)
    1895                            .dwattr $C$DW$130, DW_AT_name("IABR")
    1896                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("IABR")
    1897                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
    1898                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1899                            .dwattr $C$DW$130, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1900                            .dwattr $C$DW$130, DW_AT_decl_line(0x19e)
    1901                            .dwattr $C$DW$130, DW_AT_decl_column(0x12)
    1902                    
    1903                    $C$DW$131       .dwtag  DW_TAG_member
    1904                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$42)
    1905                            .dwattr $C$DW$131, DW_AT_name("RESERVED4")
    1906                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("RESERVED4")
    1907                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
    1908                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1909                            .dwattr $C$DW$131, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1910                            .dwattr $C$DW$131, DW_AT_decl_line(0x19f)
    1911                            .dwattr $C$DW$131, DW_AT_decl_column(0x12)
    1912                    
    1913                    $C$DW$132       .dwtag  DW_TAG_member
    1914                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$43)
    1915                            .dwattr $C$DW$132, DW_AT_name("IP")
    1916                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("IP")
    1917                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x300]
    1918                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1919                            .dwattr $C$DW$132, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1920                            .dwattr $C$DW$132, DW_AT_decl_line(0x1a0)
    1921                            .dwattr $C$DW$132, DW_AT_decl_column(0x12)
    1922                    
    1923                    $C$DW$133       .dwtag  DW_TAG_member
    1924                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$44)
    1925                            .dwattr $C$DW$133, DW_AT_name("RESERVED5")
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   36

    1926                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("RESERVED5")
    1927                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x3f0]
    1928                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1929                            .dwattr $C$DW$133, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1930                            .dwattr $C$DW$133, DW_AT_decl_line(0x1a1)
    1931                            .dwattr $C$DW$133, DW_AT_decl_column(0x12)
    1932                    
    1933                    $C$DW$134       .dwtag  DW_TAG_member
    1934                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$39)
    1935                            .dwattr $C$DW$134, DW_AT_name("STIR")
    1936                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("STIR")
    1937                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xe00]
    1938                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1939                            .dwattr $C$DW$134, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1940                            .dwattr $C$DW$134, DW_AT_decl_line(0x1a2)
    1941                            .dwattr $C$DW$134, DW_AT_decl_column(0x12)
    1942                    
    1943                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1944                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x195)
    1945                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    1946                            .dwendtag $C$DW$T$45
    1947                    
    1948                    $C$DW$T$184     .dwtag  DW_TAG_typedef
    1949                            .dwattr $C$DW$T$184, DW_AT_name("NVIC_Type")
    1950                            .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$T$45)
    1951                            .dwattr $C$DW$T$184, DW_AT_language(DW_LANG_C)
    1952                            .dwattr $C$DW$T$184, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h"
    1953                            .dwattr $C$DW$T$184, DW_AT_decl_line(0x1a3)
    1954                            .dwattr $C$DW$T$184, DW_AT_decl_column(0x04)
    1955                    
    1956                    
    1957                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1958                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x8c)
    1959                    $C$DW$135       .dwtag  DW_TAG_member
    1960                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$46)
    1961                            .dwattr $C$DW$135, DW_AT_name("CPUID")
    1962                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("CPUID")
    1963                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1965                            .dwattr $C$DW$135, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1966                            .dwattr $C$DW$135, DW_AT_decl_line(0x1b8)
    1967                            .dwattr $C$DW$135, DW_AT_decl_column(0x12)
    1968                    
    1969                    $C$DW$136       .dwtag  DW_TAG_member
    1970                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$39)
    1971                            .dwattr $C$DW$136, DW_AT_name("ICSR")
    1972                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("ICSR")
    1973                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1974                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$136, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1976                            .dwattr $C$DW$136, DW_AT_decl_line(0x1b9)
    1977                            .dwattr $C$DW$136, DW_AT_decl_column(0x12)
    1978                    
    1979                    $C$DW$137       .dwtag  DW_TAG_member
    1980                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$39)
TI ARM Assembler PC v20.2.7 Fri Aug 29 14:42:20 2025

Copyright (c) 1996-2018 Texas Instruments Incorporated
main.asm                                                             PAGE   37

    1981                            .dwattr $C$DW$137, DW_AT_name("VTOR")
    1982                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("VTOR")
    1983                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1984                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1985                            .dwattr $C$DW$137, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1986                            .dwattr $C$DW$137, DW_AT_decl_line(0x1ba)
    1987                            .dwattr $C$DW$137, DW_AT_decl_column(0x12)
    1988                    
    1989                    $C$DW$138       .dwtag  DW_TAG_member
    1990                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$39)
    1991                            .dwattr $C$DW$138, DW_AT_name("AIRCR")
    1992                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("AIRCR")
    1993                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1994                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwattr $C$DW$138, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    1996                            .dwattr $C$DW$138, DW_AT_decl_line(0x1bb)
    1997                            .dwattr $C$DW$138, DW_AT_decl_column(0x12)
    1998                    
    1999                    $C$DW$139       .dwtag  DW_TAG_member
    2000                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$39)
    2001                            .dwattr $C$DW$139, DW_AT_name("SCR")
    2002                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("SCR")
    2003                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2004                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2005                            .dwattr $C$DW$139, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2006                            .dwattr $C$DW$139, DW_AT_decl_line(0x1bc)
    2007                            .dwattr $C$DW$139, DW_AT_decl_column(0x12)
    2008                    
    2009                    $C$DW$140       .dwtag  DW_TAG_member
    2010                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$39)
    2011                            .dwattr $C$DW$140, DW_AT_name("CCR")
    2012                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("CCR")
    2013                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2014                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2015                            .dwattr $C$DW$140, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2016                            .dwattr $C$DW$140, DW_AT_decl_line(0x1bd)
    2017                            .dwattr $C$DW$140, DW_AT_decl_column(0x12)
    2018                    
    2019                    $C$DW$141       .dwtag  DW_TAG_member
    2020                            .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$47)
    2021                            .dwattr $C$DW$141, DW_AT_name("SHP")
    2022                            .dwattr $C$DW$141, DW_AT_TI_symbol_name("SHP")
    2023                            .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2024                            .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2025                            .dwattr $C$DW$141, DW_AT_decl_file("C:/ti/ccs2020/ccs/ccs_base/arm/include/CMSIS/core_cm4.h")
    2026                            .dwattr $C$DW$141, DW_AT_decl_line(0x1be)
    2027                            .dwattr $C$DW$141, DW_AT_decl_column(0x12)
    2028                    
    2029                    $C$DW$142       .dwtag  DW_TAG_member
    2030                            .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$39)
    2031                            .dwattr $C$DW$142, DW_AT_name("SHCSR")
    2032                            .dwattr $C$DW$142, DW_AT_TI_symbol_name("SHCSR")
    2033                            .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2034                            .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
